var date = new Date();
var NowYear = date.getFullYear();
console.log(['%c'+
" __     ___     _            _   _       _       ____                          ____         __        __   _ _     _       ",
" \\ \\   \/ (_) __| | ___  ___ | | | |_   _| |__   |  _ \\ _____      _____ _ __  | __ ) _   _  \\ \\      / /__(_) |   (_)_ __  ",
"  \\ \\ / /| |/ _` |/ _ \\/ _ \\| |_| | | | | '_ \\  | |_) / _ \\ \\ /\\ / / _ \\ '__| |  _ \\| | | |  \\ \\ /\\ / / _ \\ | |   | | '_ \\ ",
"   \\ V / | | (_| |  __/ (_) |  _  | |_| | |_) | |  __/ (_) \\ V  V /  __/ |    | |_) | |_| |   \\ V  V /  __/ | |___| | | | |",
"    \\_/  |_|\\__,_|\\___|\\___/|_| |_|\\__,_|_.__/  |_|   \\___/ \\_/\\_/ \\___|_|    |____/ \\__, |    \\_/\\_/ \\___|_|_____|_|_| |_|",
"                                                                                     |___/                                 ",
'%c'+"© 2020-"+NowYear+" WeiLin(w@wltip.com). All Rights Reserved.",
'%c'+"Release 2.2.4. Powered by WeiLin(w@wltip.com).",
'%c'+"分享我的人生格言：",
"学到老活到老，还有一分没学好。学习是人生不可缺少的事情加油努力的人。",
"做新时代的追梦人砥砺前行，学习没有捷径认真做好就是最好。",
"简单的事情重复做，重复的事情认真做，每个人都是一粒种子，要做一粒好种子。"
].join('\n'),'color:blue','color:green','color:red','color:#FF7F00');